kurim/pulse-esp32-hwmonitor/main/display/display_ui.c
#include "display_ui.h"
#include "display_ui_internal.h"
#include "shared_state.h"
#include "board_profiles.h"
#include "touch_xpt2046.h"
#include "touch_gt911.h"

#include "driver/spi_master.h"
#include "driver/i2c_master.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "soc/soc_caps.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_vendor.h" // Core esp_lcd: SSD1306/SSD1309 (esp_lcd_new_panel_ssd1306)
#include "esp_lcd_ili9341.h"
#include "esp_lcd_ili9488.h"      // Community component atanisoft/esp_lcd_ili9488
#include "esp_lcd_st7796.h"
#include "esp_lcd_gc9a01.h"
#if SOC_LCD_RGB_SUPPORTED
#include "esp_lcd_panel_rgb.h"    // Guition JC8048W550: RGB565-Parallelbus (nur ESP32-S3)
#include "esp_idf_version.h"
#endif
#include "esp_lvgl_port.h"
#include "esp_log.h"
#include "lvgl.h"

static const char *TAG = "ui";

// Wie ESP_ERROR_CHECK, aber statt abort() nur eine Fehlermeldung + Rueckgabe
// NULL aus der umschliessenden Funktion. Eine falsche Pin-/Displaywahl (z.B.
// nach dem Wechsel auf einen anderen Zielchip, bei dem ein generisches Profil
// eine dort nicht existierende GPIO-Nummer nutzt) darf das Geraet nicht in
// eine Boot-Schleife schicken, in der das Webportal nie erreichbar wird, um
// die Auswahl zu korrigieren - siehe display_ui_begin().
#define LCD_CHECK(x) do { \
        esp_err_t __err_rc = (x); \
        if (__err_rc != ESP_OK) { \
            ESP_LOGE(TAG, "Display-Init fehlgeschlagen (%s): %s", #x, esp_err_to_name(__err_rc)); \
            return NULL; \
        } \
    } while (0)

// Panel-/UI-Zustand, in lcd_init() bzw. den *_init()-Helfern gesetzt.
// s_profile zeigt auf s_profile_storage (kompilierter Default + im Webportal
// gesetzte Pin-Overrides gemergt, siehe board_profile_apply_overrides()),
// nicht mehr direkt auf die statische Tabelle in board_profiles.c.
static board_profile_t s_profile_storage;
const board_profile_t *s_profile;
int s_hres, s_vres;

// Von den Layout-Dateien (display_ui_rect/_round/_mono.c) befuellt, siehe
// display_ui_internal.h.
lv_obj_t *scr_main;
int s_screen = SCR_MAIN;
lv_obj_t *scr_detail, *scr_settings, *scr_standby;

// ------------------------------------------------------------------
// Display-/Backlight-Init
// ------------------------------------------------------------------
static void backlight_init(int bl_gpio)
{
    if (bl_gpio < 0) return; // z.B. selbstleuchtende OLEDs ohne Backlight-Pin

    ledc_timer_config_t t = {
        .speed_mode      = LEDC_LOW_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_8_BIT,
        .timer_num       = LEDC_TIMER_0,
        .freq_hz         = 5000,
        .clk_cfg         = LEDC_AUTO_CLK,
    };
    ledc_timer_config(&t);
    ledc_channel_config_t c = {
        .gpio_num   = bl_gpio,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel    = LEDC_CHANNEL_0,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = app_config.brightness,
        .hpoint     = 0,
    };
    ledc_channel_config(&c);
}

// ------------------------------------------------------------------
// Standby: wenn laenger keine MQTT-Hardwaredaten ankommen (weder je
// empfangen noch seit app_config.standby_timeout_s aktualisiert - deckt
// beide Faelle über denselben Zeitvergleich ab, da last_update_ms beim Boot
// bei 0 startet). Timeout ist im Webportal einstellbar, 0 = deaktiviert.
// Aufwecken per Touch/Navigationstaste (erster Druck weckt nur, loest keine
// Aktion aus) oder automatisch, sobald wieder Daten eintreffen.
//
// Einheitlich fuer alle Panels: der Bildschirminhalt wird auf eine reduzierte
// Anzeige (nur Uhrzeit+Wetter) umgeschaltet statt Details zu zeigen - bei
// LCD_SHAPE_RECT (CYD/ILI9488/ST7796S) durch Umschalten auf einen eigenen
// Standby-Screen (siehe scr_standby), bei LCD_SHAPE_ROUND analog ueber
// refresh_round_ui(). Das Backlight bleibt dabei unangetastet (frueher wurde
// es bei Panels mit Backlight-Pin abgeschaltet - das liess den Touch beim
// naechsten Aufwecken kurzzeitig "blind" wirken und wich vom Verhalten der
// anderen Panels ab).
// ------------------------------------------------------------------
bool s_standby = false;

static void enter_standby(void)
{
    if (s_standby) return;
    s_standby = true;
    if (s_profile->shape == LCD_SHAPE_RECT || s_profile->shape == LCD_SHAPE_WIDE) {
        lv_screen_load(scr_standby);
    }
}

static void exit_standby(void)
{
    if (!s_standby) return;
    s_standby = false;
    if (s_profile->shape == LCD_SHAPE_RECT) {
        lv_obj_t *target = scr_main;
        if (s_screen == SCR_CPU || s_screen == SCR_GPU) target = scr_detail;
        else if (s_screen == SCR_SETTINGS)              target = scr_settings;
        lv_screen_load(target);
    } else if (s_profile->shape == LCD_SHAPE_WIDE) {
        lv_screen_load((s_screen == SCR_SETTINGS) ? scr_settings : scr_main);
    }
}

static void check_standby(void)
{
    if (app_config.standby_timeout_s == 0) {
        exit_standby(); // Standby deaktiviert - falls gerade aktiv, sofort aufwecken
        return;
    }
    uint32_t timeout_ms = (uint32_t)app_config.standby_timeout_s * 1000u;
    bool no_data = (now_ms() - hw_info.last_update_ms) > timeout_ms;
    if (no_data) {
        enter_standby();
    } else {
        exit_standby(); // Daten wieder da -> automatisch aufwecken
    }
}

// ------------------------------------------------------------------
// Farb-SPI-Panels (ILI9341/ILI9488/ST7796S/GC9A01)
// ------------------------------------------------------------------
// Hoehe einer LVGL-Flush-Kachel in Zeilen (Breite x LCD_FLUSH_LINES Pixel).
// Kleiner = weniger internes SRAM fuer den Flush-Puffer, aber mehr einzelne
// SPI-Transaktionen pro Vollbild. Kein unterstuetztes Board hat PSRAM, daher
// bewusst klein gehalten statt auf Durchsatz optimiert.
#define LCD_FLUSH_LINES 20

static lv_display_t *lcd_init_color_spi(const board_profile_t *p)
{
    backlight_init(p->bl);

    spi_bus_config_t bus = {
        .mosi_io_num     = p->mosi,
        .miso_io_num     = p->miso,
        .sclk_io_num     = p->sclk,
        .quadwp_io_num   = -1,
        .quadhd_io_num   = -1,
        .max_transfer_sz = p->h_res * LCD_FLUSH_LINES * 2 * sizeof(uint16_t),
    };
    LCD_CHECK(spi_bus_initialize(p->spi_host, &bus, SPI_DMA_CH_AUTO));

    esp_lcd_panel_io_handle_t io = NULL;
    esp_lcd_panel_io_spi_config_t io_cfg = {
        .dc_gpio_num   = p->dc,
        .cs_gpio_num   = p->cs,
        .pclk_hz       = p->spi_hz,
        .lcd_cmd_bits  = 8,
        .lcd_param_bits = 8,
        .spi_mode      = 0,
        .trans_queue_depth = 10,
    };
    LCD_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)p->spi_host, &io_cfg, &io));

    esp_lcd_panel_handle_t panel = NULL;
    esp_lcd_panel_dev_config_t panel_cfg = {
        .reset_gpio_num = p->rst,
        .rgb_ele_order  = p->bgr ? LCD_RGB_ELEMENT_ORDER_BGR : LCD_RGB_ELEMENT_ORDER_RGB,
        .bits_per_pixel = 16,
    };

    switch (app_config.display_type) {
        case DISPLAY_ILI9488:
            // atanisoft/esp_lcd_ili9488 braucht zusaetzlich die Groesse des
            // internen RGB565->RGB666-Konvertierungspuffers (in Pixeln) -
            // an die groesste zu erwartende draw_bitmap()-Flaeche angelehnt,
            // hier eine LVGL-Flush-Kachel (Breite x LCD_FLUSH_LINES Zeilen,
            // s. dcfg unten).
            LCD_CHECK(esp_lcd_new_panel_ili9488(io, &panel_cfg, p->h_res * LCD_FLUSH_LINES, &panel));
            break;
        case DISPLAY_ST7796S:
            LCD_CHECK(esp_lcd_new_panel_st7796(io, &panel_cfg, &panel));
            break;
        case DISPLAY_GC9A01:
            LCD_CHECK(esp_lcd_new_panel_gc9a01(io, &panel_cfg, &panel));
            break;
        case DISPLAY_CYD_ILI9341:
        default:
            LCD_CHECK(esp_lcd_new_panel_ili9341(io, &panel_cfg, &panel));
            break;
    }

    LCD_CHECK(esp_lcd_panel_reset(panel));
    LCD_CHECK(esp_lcd_panel_init(panel));
    // Auf realer CYD-Hardware (ILI9341) verifiziert: Farbinversion "true" ergab
    // ein komplett invertiertes Bild, also dort "aus" (Default) richtig. Bei
    // GC9A01 war ohne Inversion der Hintergrund hell statt dunkel - deshalb
    // im Webportal umschaltbar statt fest verdrahtet (app_config.color_invert).
    LCD_CHECK(esp_lcd_panel_invert_color(panel, app_config.color_invert));
    LCD_CHECK(esp_lcd_panel_disp_on_off(panel, true));

